test/artillery-config.yml
config:
  target: "https://e055339.com"
  phases:
    - duration: 30
      arrivalRate: 30
  engines:
    socketio-v3:
      transports: ["websocket"]
  metrics:
    capture:
      - jpath: "$.responseTime"
        as: "socketio.response_time"
        aggregate: true

scenarios:
  - engine: socketio-v3
    flow:
      - emit:
          channel: "startGame"
          data: { token: "", color: "white" }
          response:
            - capture:
                json: "$.responseTime"
                as: "socketio.response_time"
      - think: 10






# config:
#   target: "https://e055339.com"
#   phases:
#     - duration: 15
#       arrivalRate: 1
#   engines:
#     socketio: {}
#   timeout: 10

# scenarios:
#   - engine: "socketio"
#     flow:
#       - emit:
#           channel: "startGame"
#           data: { token: "", color: "white" }
#       - think: 
#       - loop:
#           - emit:
#               channel: "changeDirection"
#               data: "right"
#           - think: 1
#           - emit:
#               channel: "changeDirection"
#               data: "down"
#           - think: 1
#           - emit:
#               channel: "changeDirection"
#               data: "left"
#           - think: 1
#           - emit:
#               channel: "changeDirection"
#               data: "up"
#           - think: 1